In [18]:
import pandas as pd
data = pd.read_csv('Maharashtra_Enrolment.csv')

data.head()
# data.isnull().sum()

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater
0,01-09-2025,Maharashtra,Ahmadnagar,413701,1,2,1
1,01-09-2025,Maharashtra,Ahmadnagar,413703,1,1,0
2,01-09-2025,Maharashtra,Ahmadnagar,413705,3,0,0
3,01-09-2025,Maharashtra,Ahmadnagar,414002,2,1,0
4,01-09-2025,Maharashtra,Ahmadnagar,414006,2,0,0

In [17]:
# data sorted using dates
sorted_data = data.sort_values("date")

sorted_data

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater
15265,01-01-2026,Maharashtra,Ahilyanagar,413715,0,1,0
90172,01-01-2026,Maharashtra,Thane,400709,10,2,0
90173,01-01-2026,Maharashtra,Thane,401101,3,2,0
90174,01-01-2026,Maharashtra,Thane,401104,1,0,0
90175,01-01-2026,Maharashtra,Thane,401202,2,0,0
...,...,...,...,...,...,...,...
89642,31-12-2025,Maharashtra,Kolhapur,416204,1,1,0
89643,31-12-2025,Maharashtra,Kolhapur,416208,4,0,0
89644,31-12-2025,Maharashtra,Kolhapur,416210,1,0,0
89646,31-12-2025,Maharashtra,Kolhapur,416505,1,0,0
52675,31-12-2025,Maharashtra,Mumbai,400104,9,2,0

In [20]:
print("The total available data is = ",data.size)

print("The total rows & column is = ",data.shape)

The total available data is =  652288
The total rows & column is =  (93184, 7)

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater
0,01-09-2025,Maharashtra,Ahmadnagar,413701,1,2,1
1,01-09-2025,Maharashtra,Ahmadnagar,413703,1,1,0
2,01-09-2025,Maharashtra,Ahmadnagar,413705,3,0,0
3,01-09-2025,Maharashtra,Ahmadnagar,414002,2,1,0
4,01-09-2025,Maharashtra,Ahmadnagar,414006,2,0,0
...,...,...,...,...,...,...,...
93179,19-06-2025,Maharashtra,Yavatmal,445302,5,2,0
93180,19-06-2025,Maharashtra,Yavatmal,445305,3,2,0
93181,19-06-2025,Maharashtra,Yavatmal,445307,1,0,0
93182,19-06-2025,Maharashtra,Yavatmal,445308,1,0,0
93183,19-06-2025,Maharashtra,Yavatmal,445402,4,0,0

In [29]:
frame  =  pd.DataFrame(data)

frame

pune = frame.groupby("district")